## [판다스 데이터 분석](http://datascienceschool.net/01%20python/04.00%204%EC%9E%A5%20%ED%8C%90%EB%8B%A4%EC%8A%A4%20%EB%8D%B0%EC%9D%B4%ED%84%B0%20%EB%B6%84%EC%84%9D.html)

> [데이터 사이언스 스쿨](http://datascienceschool.net/intro.html)의 연습문제를 풀이합니다.

In [1]:
# 판다스 패키지 임포트

import pandas as pd

#### 1. 시리즈 인덱싱 
    * 문자열 라벨을 이용한 슬라이싱을 하는 경우에는 숫자 인덱싱과 달리 콜론(:) 기호 뒤에 오는 값도 결과에 포함되므로 주의해야 한다.

In [2]:
s = pd.Series([9904312, 3448737, 2890451, 2466052],
              index=["서울", "부산", "인천", "대구"])
s

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [3]:
s["부산":"대구"]  # 부산에서 대구까지 (대구도 포함)

부산    3448737
인천    2890451
대구    2466052
dtype: int64

#### 2. 시리즈와 딕셔너리 자료형

딕셔너리의 원소는 순서를 가지지 않으므로 시리즈의 데이터도 순서가 보장되지 않는다. 만약 순서를 정하고 싶다면 인덱스를 리스트로 지정해야 한다.

In [4]:
s2 = pd.Series({"서울": 9631482, "부산": 3393191, "인천": 2632035, "대전": 1490158},
               index=["부산", "서울", "인천", "대전"])
s2

부산    3393191
서울    9631482
인천    2632035
대전    1490158
dtype: int64

#### 3. NaN이 아닌 값을 구하려면 notnull 메서드를 사용

In [9]:
ds = s - s2
ds

대구         NaN
대전         NaN
부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [10]:
ds[ds.notnull()]

부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [13]:
# 연습 문제 4.1.1
# (1) 임의로 두 개의 시리즈 객체를 만든다. 모두 문자열 인덱스를 가져야 하며 두 시리즈에 공통적으로 포함되지 않는 라벨이 있어야 한다.

data1 = pd.Series([98, 100, 90],
              index=["국어", "수학", "영어"])
data2 = pd.Series([78, 50, 73],
              index=["국어", "영어", "화학"])

#(2) 위에서 만든 두 시리즈 객체를 이용하여 사칙 연산을 한다.

print(data1+data2)
print(data1-data2)
print(data1*data2)
print(data1/data2)

국어    176.0
수학      NaN
영어    140.0
화학      NaN
dtype: float64
국어    20.0
수학     NaN
영어    40.0
화학     NaN
dtype: float64
국어    7644.0
수학       NaN
영어    4500.0
화학       NaN
dtype: float64
국어    1.25641
수학        NaN
영어    1.80000
화학        NaN
dtype: float64

In [19]:
# 연습 문제 4.1.2

# 다음 조건을 만족하는 임의의 데이터프레임을 하나 만든다.
# (1) 열의 갯수와 행의 갯수가 각각 5개 이상이어야 한다.
# (2) 열에는 정수, 문자열, 실수 자료형 데이터가 각각 1개 이상씩 포함되어 있어야 한다.

data = {
    "빵재고": [10,20,4,6,2],
    "빵종류": ["소금빵","초코소라빵","슈크림빵","와플","도넛"],
    "가격상승률": [0.0283, 0.0163, 0.0982, 0.0141, 0.0299],
    "가격": [3000,2000,1500,3500,1500],
    "지역": ["수도권", "경상권", "수도권", "경상권", "수도권"]
}
df = pd.DataFrame(data)
df

   빵재고    빵종류   가격상승률    가격   지역
0   10    소금빵  0.0283  3000  수도권
1   20  초코소라빵  0.0163  2000  경상권
2    4   슈크림빵  0.0982  1500  수도권
3    6     와플  0.0141  3500  경상권
4    2     도넛  0.0299  1500  수도권

In [27]:
df[["지역","빵종류"]]

    지역    빵종류
0  수도권    소금빵
1  경상권  초코소라빵
2  수도권   슈크림빵
3  경상권     와플
4  수도권     도넛

#### 4. 행 인덱싱
* 만약 행 단위로 인덱싱을 하고자 하면 **항상 슬라이싱(slicing)**을 해야 한다. 인덱스의 값이 문자 라벨이면 라벨 슬라이싱도 가능하다.

In [39]:
# 연습 문제 4.1.3
# 다음 데이터프레임에서 지정하는 데이터를 뽑아내거나 처리하라.

data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)

In [40]:
# (1) 모든 학생의 수학 점수를 시리즈로 나타낸다.
df["수학"]

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [41]:
# (2) 모든 학생의 국어와 영어 점수를 데이터 프레임으로 나타낸다.
df[["국어","영어"]]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [46]:
# (3) 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.

df["평균"] = (df["국어"] + df["영어"] + df["수학"]) / 3
df

    국어  영어  수학         평균
춘향  80  90  90  86.666667
몽룡  90  70  60  73.333333
향단  70  60  80  70.000000
방자  30  40  70  46.666667

In [51]:
# (4) 방자의 영어 점수를 80점으로 수정하고 평균 점수도 다시 계산한다.

df["영어"]["방자"] = 80
df["평균"] = (df["국어"] + df["영어"] + df["수학"]) / 3
df

<ipython-input-51-5734afbfc314>:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["영어"]["방자"] = 80

    국어  영어  수학         평균
춘향  80  90  90  86.666667
몽룡  90  70  60  73.333333
향단  70  60  80  70.000000
방자  30  80  70  60.000000

In [65]:
# (5) 춘향의 점수를 데이터프레임으로 나타낸다.

df.iloc[0:1,0:3]

    국어  영어  수학
춘향  80  90  90

In [66]:
# (6) 향단의 점수를 시리즈로 나타낸다.

df.iloc[2,0:3]

국어    70.0
영어    60.0
수학    80.0
Name: 향단, dtype: float64

In [75]:
# 연습 문제 4.3.1
# 1. 모든 행과 열에 라벨을 가지는 5 x 5 이상의 크기를 가지는 데이터프레임을 만든다.
# 2. 10가지 이상의 방법으로 특정한 행과 열을 선택한다.

data = {
    "국어": [80, 90, 70, 30, 40],
    "영어": [90, 70, 60, 40, 100],
    "수학": [90, 60, 80, 70, 90],
    "화학": [90, 60, 80, 70, 90],
    "생물": [90, 60, 80, 70, 90]
}
# columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자", "정윤"]
df = pd.DataFrame(data, index=index)

df

    국어   영어  수학  화학  생물
춘향  80   90  90  90  90
몽룡  90   70  60  60  60
향단  70   60  80  80  80
방자  30   40  70  70  70
정윤  40  100  90  90  90

In [77]:
# 1
df.loc[df['화학']==90]

    국어   영어  수학  화학  생물
춘향  80   90  90  90  90
정윤  40  100  90  90  90

In [78]:
# 2
df.loc[df['생물']>=80]

    국어   영어  수학  화학  생물
춘향  80   90  90  90  90
향단  70   60  80  80  80
정윤  40  100  90  90  90

In [80]:
# 3
df.loc["정윤","영어"]

100

In [82]:
# 4
df.loc[:,"화학"]

춘향    90
몽룡    60
향단    80
방자    70
정윤    90
Name: 화학, dtype: int64

In [84]:
# 5
df.loc[:,["국어","수학"]]

    국어  수학
춘향  80  90
몽룡  90  60
향단  70  80
방자  30  70
정윤  40  90

In [70]:
# 6
df.iloc[:,3:]

    화학  생물
춘향  90  90
몽룡  60  60
향단  80  80
방자  70  70
정윤  90  90

In [85]:
# 7
df.iloc[2,3]

80

In [86]:
# 8
df.iloc[0:2,3]

춘향    90
몽룡    60
Name: 화학, dtype: int64

In [87]:
# 9
df.iloc[:2,:3]

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60

In [88]:
# 10
df.iloc[4]

국어     40
영어    100
수학     90
화학     90
생물     90
Name: 정윤, dtype: int64

### 4.4 데이터프레임의 데이터 조작

In [89]:
import seaborn as sns
titanic = sns.load_dataset("titanic")
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [91]:
# 연습 문제 4.4.1

titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

In [94]:
titanic["pclass"].value_counts()

3    491
1    216
2    184
Name: pclass, dtype: int64

In [95]:
# 연습 문제 4.4.2
# 타이타닉호 승객에 대해 성별(sex) 인원수, 나이별(age) 인원수, 선실별(class) 인원수, 사망/생존(alive) 인원수를 구하라.

titanic["sex"].value_counts()

male      577
female    314
Name: sex, dtype: int64

In [96]:
titanic["age"].value_counts()

24.00    30
22.00    27
18.00    26
19.00    25
30.00    25
         ..
55.50     1
70.50     1
66.00     1
23.50     1
0.42      1
Name: age, Length: 88, dtype: int64

In [97]:
titanic["pclass"].value_counts()

3    491
1    216
2    184
Name: pclass, dtype: int64

In [98]:
titanic["survived"].value_counts()

0    549
1    342
Name: survived, dtype: int64

In [101]:
# 연습 문제 4.4.3
# 1. 타이타닉호 승객의 평균 나이를 구하라.

titanic["age"].mean()

29.69911764705882

In [104]:
# 2. 타이타닉호 승객중 여성 승객의 평균 나이를 구하라.

titanic.loc[titanic["sex"]=="female"]["age"].mean()

27.915708812260537

In [106]:
# 3. 타이타닉호 승객중 1등실 선실의 여성 승객의 평균 나이를 구하라.

titanic.loc[(titanic["pclass"]==1)&(titanic["sex"]=="female")]["age"].mean()

34.61176470588235

In [108]:
# 연습 문제 4.4.4
# 타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 category1 열을 만들어라. category1 카테고리는 다음과 같이 정의된다.

# 1. 20살이 넘으면 성별을 그대로 사용한다.
# 2. 20살 미만이면 성별에 관계없이 “child”라고 한다.

titanic['category1'] = titanic.apply(lambda r: r.sex if r.age>=20 else "child", axis=1)
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,male
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,male
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,male

In [142]:
# 연습 문제 4.4.5
# 타이타닉호의 승객 중 나이를 명시하지 않은 고객은 나이를 명시한 고객의 평균 나이 값이 되도록 titanic 데이터프레임을 고쳐라.

titanic['age'].fillna(value=titanic['age'].mean(),inplace=True)
titanic['age'] = titanic['age'].astype('int64')
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1,category2
886,0,2,male,27,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,male,male27.0
887,1,1,female,19,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child,female19.0
888,0,3,female,29,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child,female29.69911764705882
889,1,1,male,26,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,male,male26.0
890,0,3,male,32,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,male,male32.0

> 판다스 이용해서 푸신 분 있는지

In [143]:
# 연습 문제 4.4.6

# 타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 category2 열을 만들어라. category2 카테고리는 다음과 같이 정의된다.
# 성별을 나타내는 문자열 male 또는 female로 시작한다.
# 성별을 나타내는 문자열 뒤에 나이를 나타내는 문자열이 온다.
# 예를 들어 27살 남성은 male27 값이 된다.

titanic['category2'] = titanic['sex'] + titanic['age'].astype(str)
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1,category2
886,0,2,male,27,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,male,male27
887,1,1,female,19,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child,female19
888,0,3,female,29,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child,female29
889,1,1,male,26,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,male,male26
890,0,3,male,32,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,male,male32

In [144]:
# 연습 문제 4.4.7

bins = [1, 20, 30, 50, 70, 100]
labels = ["미성년자", "청년", "중년", "장년", "노년"]

data = pd.cut(titanic.age, bins, labels=labels).value_counts()
print(data)

rate = [data[i]/data.sum() for i in range(len(labels))]
print(rate)
print(sum(rate))

청년      408
중년      239
미성년자    166
장년       60
노년        4
Name: age, dtype: int64
[0.4652223489167617, 0.2725199543899658, 0.18928164196123148, 0.06841505131128849, 0.004561003420752566]
1.0

In [151]:
# 연습 문제 4.4.8
bins = [1, 20, 30, 50, 70, 100]
labels = ["미성년자", "청년", "중년", "장년", "노년"]

cate = pd.cut(titanic.age, bins, labels=labels).astype(str)
print(cate)

titanic['sex'] = titanic['sex'].map({'female':"여성",'male':"남성"})
titanic['category3'] = titanic.apply(lambda r: "미성년자" if r.age<20 else cate[r.age]+r.sex, axis=1)

titanic.tail()

0        청년
1        중년
2        청년
3        중년
4        중년
       ...
886      청년
887    미성년자
888      청년
889      청년
890      중년
Name: age, Length: 891, dtype: object

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1,category2,category3
886,0,2,남성,27,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,male,male27,미성년자남성
887,1,1,여성,19,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child,female19,미성년자
888,0,3,여성,29,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child,female29,청년여성
889,1,1,남성,26,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,male,male26,청년남성
890,0,3,남성,32,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,male,male32,청년남성